Creating a Dataframe

In [2]:
import pandas as pd 
import numpy as np

In [3]:
data  = {
    "Name":["Ram" , "Shyam" , "Sita"],
    "Age":[20,21,19],
    "City":["Agra" , "Delhi" , "Agra"],
    "Salary":[20000,25000,20000]
}

In [4]:
df = pd.DataFrame(data)

In [5]:
df

    Name  Age   City  Salary
0    Ram   20   Agra   20000
1  Shyam   21  Delhi   25000
2   Sita   19   Agra   20000

In [6]:
data_list = [
    ["Ram" , 20 , "Agra" , 20000],
    ["Ram" , 20 , "Agra" , 20000],
    ["Ram" , 20 , "Agra" , 20000],
    ["Ram" , 20 , "Agra" , 20000]
    ]

df2 = pd.DataFrame(data_list)
df2

     0   1     2      3
0  Ram  20  Agra  20000
1  Ram  20  Agra  20000
2  Ram  20  Agra  20000
3  Ram  20  Agra  20000

In [7]:
columns = ["Name" , "Age" , "City" , "Salary"]
df2 = pd.DataFrame(data_list , columns=columns)
df2

  Name  Age  City  Salary
0  Ram   20  Agra   20000
1  Ram   20  Agra   20000
2  Ram   20  Agra   20000
3  Ram   20  Agra   20000

In [12]:
df2["Name"]
df2["Name"][1]
df2[["Name" , "City"]]

  Name  City
0  Ram  Agra
1  Ram  Agra
2  Ram  Agra
3  Ram  Agra

Creation of a column

In [15]:
df2["des"] = ["doctor" , "engineer","doctor","engineer"]
df2

  Name  Age  City  Salary       des
0  Ram   20  Agra   20000    doctor
1  Ram   20  Agra   20000  engineer
2  Ram   20  Agra   20000    doctor
3  Ram   20  Agra   20000  engineer

In [16]:
df2.drop("des")

KeyError: "['des'] not found in axis"

In [17]:
df2.drop("des",axis=1)

  Name  Age  City  Salary
0  Ram   20  Agra   20000
1  Ram   20  Agra   20000
2  Ram   20  Agra   20000
3  Ram   20  Agra   20000

In [18]:
df2

  Name  Age  City  Salary       des
0  Ram   20  Agra   20000    doctor
1  Ram   20  Agra   20000  engineer
2  Ram   20  Agra   20000    doctor
3  Ram   20  Agra   20000  engineer

In [19]:
df2.drop("des" ,axis=1 , inplace=True)

In [21]:
df2

  Name  Age  City  Salary
0  Ram   20  Agra   20000
1  Ram   20  Agra   20000
2  Ram   20  Agra   20000
3  Ram   20  Agra   20000

In [23]:
df2.drop(0)

  Name  Age  City  Salary
1  Ram   20  Agra   20000
2  Ram   20  Agra   20000
3  Ram   20  Agra   20000

In [25]:
df2

  Name  Age  City  Salary
0  Ram   20  Agra   20000
1  Ram   20  Agra   20000
2  Ram   20  Agra   20000
3  Ram   20  Agra   20000

In [28]:
df2.loc[2]

Name        Ram
Age          20
City       Agra
Salary    20000
Name: 2, dtype: object

In [30]:
df2.loc[[1,2]]

  Name  Age  City  Salary
1  Ram   20  Agra   20000
2  Ram   20  Agra   20000

In [32]:
df2.iloc[0]

Name        Ram
Age          20
City       Agra
Salary    20000
Name: 0, dtype: object

**Selecting a subset of a dataframe**

In [37]:
df2.loc[[2,3]][["Name" , "Age"]]

  Name  Age
2  Ram   20
3  Ram   20

**Conditional Selection**

In [38]:
df2[df2["Age"] > 3]

  Name  Age  City  Salary
0  Ram   20  Agra   20000
1  Ram   20  Agra   20000
2  Ram   20  Agra   20000
3  Ram   20  Agra   20000

In [41]:
df2[(df2["Age"]>2) & (df2["Salary"] > 10000)]

  Name  Age  City  Salary
0  Ram   20  Agra   20000
1  Ram   20  Agra   20000
2  Ram   20  Agra   20000
3  Ram   20  Agra   20000